yangliangquan/ChibiOS/os/hal/ports/CH32/LLD/USBv1/ch32_usb.h
#pragma once
/* usb device info define  */
#define DEF_USB_VID                  0x1A86
#define DEF_USB_PID                  0xFE0C
/* USB device descriptor, device serial number */
#define DEF_IC_PRG_VER               DEF_FILE_VERSION

/******************************************************************************/
/* usb device endpoint size define */
#define DEF_USBD_UEP0_SIZE           64     /* usb hs/fs device end-point 0 size */
/* HS */
#define DEF_USBD_HS_PACK_SIZE        512    /* usb hs device max bluk/int pack size */
#define DEF_USBD_HS_ISO_PACK_SIZE    1024   /* usb hs device max iso pack size */
/* FS */
#define DEF_USBD_FS_PACK_SIZE        64     /* usb fs device max bluk/int pack size */
#define DEF_USBD_FS_ISO_PACK_SIZE    1023   /* usb fs device max iso pack size */
/* LS */
#define DEF_USBD_LS_UEP0_SIZE        8      /* usb ls device end-point 0 size */
#define DEF_USBD_LS_PACK_SIZE        64     /* usb ls device max int pack size */

#define DEFAULT_ENDP0_SIZE          8          // default maximum packet size for endpoint 0
#define MAX_PACKET_SIZE             64         // maximum packet size

/* HS end-point size */
#define DEF_USB_EP0_HS_SIZE          DEF_USBD_UEP0_SIZE
#define DEF_USB_EP1_HS_SIZE          DEF_USBD_HS_PACK_SIZE
#define DEF_USB_EP2_HS_SIZE          DEF_USBD_HS_PACK_SIZE
#define DEF_USB_EP3_HS_SIZE          DEF_USBD_HS_PACK_SIZE
#define DEF_USB_EP4_HS_SIZE          DEF_USBD_HS_PACK_SIZE
#define DEF_USB_EP5_HS_SIZE          DEF_USBD_HS_PACK_SIZE
#define DEF_USB_EP6_HS_SIZE          DEF_USBD_HS_PACK_SIZE
#define DEF_USB_EP7_HS_SIZE          DEF_USBD_HS_PACK_SIZE

/* FS end-point size */
#define DEF_USB_EP1_FS_SIZE          DEF_USBD_FS_PACK_SIZE
#define DEF_USB_EP2_FS_SIZE          DEF_USBD_FS_PACK_SIZE
#define DEF_USB_EP3_FS_SIZE          DEF_USBD_FS_PACK_SIZE
#define DEF_USB_EP4_FS_SIZE          DEF_USBD_FS_PACK_SIZE
#define DEF_USB_EP5_FS_SIZE          DEF_USBD_FS_PACK_SIZE
#define DEF_USB_EP6_FS_SIZE          DEF_USBD_FS_PACK_SIZE
#define DEF_USB_EP7_FS_SIZE          DEF_USBD_FS_PACK_SIZE
/* LS end-point size */

/* USB_CONTROL */
#define USBSS_DEV_ADDR_MASK         0x7F000000
#define USBSS_UIE_FIFO_RXOV         0x00800000           
#define USBSS_UIE_FIFO_TXOV         0x00400000           
#define USBSS_UIE_ITP               0x00100000       
#define USBSS_UIE_RX_PING           0x00080000         
#define USBSS_UDIE_STATUS           0x00040000
#define USBSS_UHIE_NOTIF            0x00040000  
#define USBSS_UDIE_SETUP            0x00020000       
#define USBSS_UHIE_ERDY             0x00020000     
#define USBSS_UIE_TRANSFER          0x00010000           
#define USBSS_CHAIN_CONFLICT        0x00008000               
#define USBSS_TX_ERDY_MODE          0x00004000           
#define USBSS_HP_PEND_MASK          0x00000300    
 #define USBSS_HP_PENDING           0x00000200
#define USBSS_HOST_MODE             0x00000080       
#define USBSS_ITP_EN                0x00000040       
#define USBSS_SETUP_FLOW            0x00000020           
#define USBSS_DIR_ABORT             0x00000010       
#define USBSS_DMA_MODE              0x00000008       
#define USBSS_FORCE_RST             0x00000004       
#define USBSS_USB_CLR_ALL           0x00000002           
#define USBSS_DMA_EN                0x00000001  

/* USB_STATUS */
#define USBSS_HRX_RES_MASK          0xC0000000
#define USBSS_HTX_RES_MASK          0x00C00000
#define USBSS_EP_DIR_MASK           0x00001000
#define USBSS_EP_ID_MASK            0x00000700
#define USBSS_UIF_FIFO_RXOV         0x00000080  
#define USBSS_UIF_FIFO_TXOV         0x00000040           
#define USBSS_UIF_ITP               0x00000010       
#define USBSS_UIF_RX_PING           0x00000008           
#define USBSS_UDIF_STATUS           0x00000004           
#define USBSS_UHIF_NOTIF            0x00000004           
#define USBSS_UDIF_SETUP            0x00000002           
#define USBSS_UHIF_ERDY             0x00000002       
#define USBSS_UIF_TRANSFER          0x00000001   

/* USB_ITP */
#define USBSS_ITP_INTERVAL_MASK     0x00003FFF

/* USB_ITP_ADJ */
#define USBSS_ITP_DELTA             0x001FFF00
#define USBSS_ITP_DELAYED           0x00000080
#define USBSS_ITP_ADJ_CR_MASK       0x0000007F

/* UEP_TX_EN */
#define USBSS_EP15_TX_EN            0x00008000
#define USBSS_EP14_TX_EN            0x00004000
#define USBSS_EP13_TX_EN            0x00002000
#define USBSS_EP12_TX_EN            0x00001000
#define USBSS_EP11_TX_EN            0x00000800
#define USBSS_EP10_TX_EN            0x00000400
#define USBSS_EP9_TX_EN             0x00000200
#define USBSS_EP8_TX_EN             0x00000100
#define USBSS_EP7_TX_EN             0x00000080
#define USBSS_EP6_TX_EN             0x00000040
#define USBSS_EP5_TX_EN             0x00000020
#define USBSS_EP4_TX_EN             0x00000010
#define USBSS_EP3_TX_EN             0x00000008
#define USBSS_EP2_TX_EN             0x00000004
#define USBSS_EP1_TX_EN             0x00000002
#define USBSS_UH_TX_EN              0x00000002

/* UEP_RX_EN */
#define USBSS_EP15_RX_EN            0x00008000
#define USBSS_EP14_RX_EN            0x00004000
#define USBSS_EP13_RX_EN            0x00002000
#define USBSS_EP12_RX_EN            0x00001000
#define USBSS_EP11_RX_EN            0x00000800
#define USBSS_EP10_RX_EN            0x00000400
#define USBSS_EP9_RX_EN             0x00000200
#define USBSS_EP8_RX_EN             0x00000100
#define USBSS_EP7_RX_EN             0x00000080
#define USBSS_EP6_RX_EN             0x00000040
#define USBSS_EP5_RX_EN             0x00000020
#define USBSS_EP4_RX_EN             0x00000010
#define USBSS_EP3_RX_EN             0x00000008
#define USBSS_EP2_RX_EN             0x00000004
#define USBSS_EP1_RX_EN             0x00000002
#define USBSS_UH_RX_EN              0x00000002

/* UEP0_TX_CTRL */
#define USBSS_UIF_EP0_TX_ACT        0x80000000
#define USBSS_EP0_TX_FLOW           0x02000000
#define USBSS_EP0_TX_PP             0x01000000
#define USBSS_EP0_TX_ERDY           0x00800000
#define USBSS_EP0_TX_RES            0x00600000
 #define USBSS_EP0_TX_NRDY          0x00000000
 #define USBSS_EP0_TX_DPH           0x00200000
 #define USBSS_EP0_TX_STALL         0x00400000
#define USBSS_EP0_TX_SEQ_MASK       0x001F0000 
 #define USBSS_NUMP_1               0x00010000 
 #define USBSS_NUMP_2               0x00020000 
 #define USBSS_NUMP_3               0x00030000 
 #define USBSS_NUMP_4               0x00040000 
 #define USBSS_NUMP_5               0x00050000 
 #define USBSS_NUMP_6               0x00060000 
 #define USBSS_NUMP_7               0x00070000 
 #define USBSS_NUMP_8               0x00080000 
 #define USBSS_NUMP_9               0x00090000 
 #define USBSS_NUMP_10              0x000A0000 
 #define USBSS_NUMP_11              0x000B0000
 #define USBSS_NUMP_12              0x000C0000
 #define USBSS_NUMP_13              0x000D0000
 #define USBSS_NUMP_14              0x000E0000
 #define USBSS_NUMP_15              0x000F0000
 #define USBSS_NUMP_16              0x00100000 
#define USBSS_EP0_TX_LEN_MASK       0x000007FF

/* UEP0_RX_CTRL */
#define USBSS_UIF_EP0_RX_ACT        0x80000000
#define USBSS_EP0_RX_PP             0x01000000
#define USBSS_EP0_RX_ERDY           0x00800000
#define USBSS_EP0_RX_RES            0x00600000
 #define USBSS_EP0_RX_NRDY          0x00000000
 #define USBSS_EP0_RX_ACK           0x00200000
 #define USBSS_EP0_RX_STALL         0x00400000
#define USBSS_EP0_RX_SEQ_MASK       0x001F0000
#define USBSS_EP0_RX_LEN_MASK       0x000007FF

