yangliangquan/ChibiOS/os/hal/ports/CH32/LLD/USBv1/ch32_usb.h
/* R8_UEPn_TX_CFG */
#define USBSS_EP_TX_CHAIN_AUTO      0x80
#define USBSS_EP_TX_FIFO_MODE       0x40
#define USBSS_EP_TX_FIFO_CFG        0x20
#define USBSS_EP_TX_EOB_MODE        0x08
#define USBSS_EP_TX_ERDY_AUTO       0x04
#define USBSS_EP_TX_SEQ_AUTO        0x02
#define USBSS_EP_TX_ISO_MODE        0x01

/* R8_UEPn_TX_CR */
#define USBSS_EP_TX_HALT            0x80
#define USBSS_EP_TX_CLR             0x40
#define USBSS_EP_TX_CHAIN_CLR       0x20
#define USBSS_EP_TX_ERDY_NUMP_MASK  0x1F


/* R8_UEPn_TX_SEQ */
#define USBSS_EP_TX_SEQ_NUM_MASK    0x1F

/* R8_UEPn_TX_ST */
#define USBSS_EP_TX_INT_FLAG        0x80
#define USBSS_EP_TX_FC_ST           0x40
#define USBSS_EP_TX_ERDY_REQ        0x20
#define USBSS_EP_TX_CHAIN_RES       0x10
#define USBSS_EP_TX_CHAIN_EN_MASK   0x0F

/* R8_UEPn_TX_CHAIN_CR */
#define USBSS_EP_TX_CUR_USE         0xC0               
#define USBSS_EP_TX_CUR_CFG         0x30               
#define USBSS_EP_TX_FORCE_RET       0x04             
#define USBSS_EP_TX_RET_SEL         0x03               

/* R8_UEPn_TX_CHAIN_ST */
#define USBSS_EP_TX_CHAIN_EN        0x80
#define USBSS_EP_TX_CHAIN_IF        0x40
#define USBSS_EP_TX_EOB_LPF         0x20
#define USBSS_EP_TX_NUMP_EMPTY      0x08
#define USBSS_EP_TX_DPH_PP          0x04
#define USBSS_EP_TX_CHAIN_NO_MASK   0x03

/* R8_UEPn_RX_CFG */
#define USBSS_EP_RX_CHAIN_AUTO      0x80
#define USBSS_EP_RX_FIFO_MODE       0x40
#define USBSS_EP_RX_FIFO_CFG        0x20
#define USBSS_EP_RX_EOB_MODE        0x08
#define USBSS_EP_RX_ERDY_AUTO       0x04
#define USBSS_EP_RX_SEQ_AUTO        0x02
#define USBSS_EP_RX_ISO_MODE        0x01

/* R8_UEPn_RX_CR */
#define USBSS_EP_RX_HALT            0x80
#define USBSS_EP_RX_CLR             0x40
#define USBSS_EP_RX_CHAIN_CLR       0x20
#define USBSS_EP_RX_ERDY_NUMP_MASK  0x1F

/* R8_UEPn_RX_SEQ */
#define USBSS_EP_RX_SEQ_NUM_MASK    0x1F

/* R8_UEPn_RX_ST */
#define USBSS_EP_RX_INT_FLAG        0x80
#define USBSS_EP_RX_FC_ST           0x40
#define USBSS_EP_RX_ERDY_REQ        0x20
#define USBSS_EP_RX_CHAIN_RES       0x10
#define USBSS_EP_RX_CHAIN_EN_MASK   0x0F

/* R8_UEPn_RX_CHAIN_CR */
#define USBSS_EP_RX_CUR_USE         0xC0               
#define USBSS_EP_RX_CUR_CFG         0x30               
#define USBSS_EP_RX_FORCE_RET       0x04             
#define USBSS_EP_RX_RET_SEL         0x03               

/* R8_UEPn_RX_CHAIN_ST */
#define USBSS_EP_RX_CHAIN_EN        0x80
#define USBSS_EP_RX_CHAIN_IF        0x40
#define USBSS_EP_RX_LPF_FLAG        0x20
#define USBSS_EP_RX_ISO_PKT_ERR     0x10
#define USBSS_EP_RX_NUMP_EMPTY      0x08
#define USBSS_EP_RX_DPH_PP          0x04
#define USBSS_EP_RX_CHAIN_NO_MASK   0x03

/* R32_UH_TX_CTRL */
#define USBSS_UH_TX_ACT             0x80000000
#define USBSS_UH_TX_ISO             0x40000000
#define USBSS_UH_TX_SETUP           0x20000000
#define USBSS_UH_TX_STATUS          0x10000000
#define USBSS_UH_TX_LPF             0x00800000
#define USBSS_UH_TX_RES             0x00600000
 #define USBSS_UH_TX_NRDY           0x00000000
 #define USBSS_UH_TX_ACK            0x00200000
 #define USBSS_UH_TX_STALL          0x00400000
#define USBSS_UH_TX_SEQ             0x001F0000
#define USBSS_UH_TX_EP              0x0000F000
#define USBSS_UH_TX_LEN_MASK        0x000007FF  

/* R32_UH_RX_CTRL */
#define USBSS_UH_RX_ACT             0x80000000
#define USBSS_UH_RX_ISO             0x40000000
#define USBSS_UH_RX_NUMP            0x1F000000
#define USBSS_UH_RX_RES             0x00600000
 #define USBSS_UH_RX_NRDY           0x00000000
 #define USBSS_UH_RX_ACK            0x00200000
 #define USBSS_UH_RX_STALL          0x00400000
#define USBSS_UH_RX_SEQ             0x001F0000
#define USBSS_UH_RX_EP              0x0000F000
#define USBSS_UH_RX_LEN_MASK        0x000007FF   

/* R32_HOST_STATUS */
#define USBSS_UH_ITP_PRESAGE        0x000C0000
#define USBSS_UH_RX_ISO_PKT_ERR     0x00020000
#define USBSS_UH_RX_EOB_LPF         0x00010000
#define USBSS_UH_RX_ERDY_DIR        0x00008000
#define USBSS_UH_RX_ERDY_NUMP       0x00001F00
#define USBSS_UH_RX_ERDY_EP         0x000000F0

/*******************************************************************************/
/* USBHS Related Register Macro Definition */

/* R8_USB_CTRL */
#define  USBHS_UD_LPM_EN            0x80
#define  USBHS_UD_DEV_EN            0x20
#define  USBHS_UD_DMA_EN            0x10
#define  USBHS_UD_PHY_SUSPENDM      0x08
#define  USBHS_UD_CLR_ALL           0x04
#define  USBHS_UD_RST_SIE           0x02
#define  USBHS_UD_RST_LINK          0x01

/* R8_USB_BASE_MODE */
#define  USBHS_UD_SPEED_FULL        0x00
#define  USBHS_UD_SPEED_HIGH        0x01
#define  USBHS_UD_SPEED_LOW         0x02
#define  USBHS_UD_SPEED_TYPE        0x03       

/* R8_USB_INT_EN */
#define  USBHS_UDIE_FIFO_OVER       0x80
#define  USBHS_UDIE_LINK_RDY        0x40
#define  USBHS_UDIE_SOF_ACT         0x20
#define  USBHS_UDIE_TRANSFER        0x10
#define  USBHS_UDIE_LPM_ACT         0x08
#define  USBHS_UDIE_BUS_SLEEP       0x04
#define  USBHS_UDIE_SUSPEND         0x02
#define  USBHS_UDIE_BUS_RST         0x01

/* R8_USB_DEV_AD */
#define  USBHS_UD_DEV_ADDR          0x7F

/* R8_USB_WAKE_CTRL */
#define  USBHS_UD_REMOTE_WKUP       0x01

/* R8_USB_TEST_MODE */
#define  USBHS_UD_TEST_EN           0x80
#define  USBHS_UD_TEST_SE0NAK       0x08
#define  USBHS_UD_TEST_PKT          0x04
#define  USBHS_UD_TEST_K            0x02
#define  USBHS_UD_TEST_J            0x01

/* R16_USB_LPM_DATA */
#define  USBHS_UD_LPM_BUSY          0x8000
#define  USBHS_UD_LPM_DATA          0x07FF

/* R8_USB_INT_FG */
#define  USBHS_UDIF_FIFO_OV         0x80
#define  USBHS_UDIF_LINK_RDY        0x40
#define  USBHS_UDIF_RX_SOF          0x20
#define  USBHS_UDIF_TRANSFER        0x10
#define  USBHS_UDIF_RTX_ACT         0x10
#define  USBHS_UDIF_LPM_ACT         0x08
#define  USBHS_UDIF_BUS_SLEEP       0x04
#define  USBHS_UDIF_SUSPEND         0x02
#define  USBHS_UDIF_BUS_RST         0x01

/* R8_USB_INT_ST */
#define  USBHS_UDIS_EP_DIR          0x10
#define  USBHS_UDIS_EP_ID_MASK      0x07

/* R8_USB_MIS_ST */
#define  USBHS_UDMS_HS_MOD          0x80
#define  USBHS_UDMS_SUSP_REQ        0x10
#define  USBHS_UDMS_SIE_FREE        0x08
#define  USBHS_UDMS_SLEEP           0x04
#define  USBHS_UDMS_SUSPEND         0x02
#define  USBHS_UDMS_READY           0x01

/* R16_USB_FRAME_NO */
#define  USBHS_UD_MFRAME_NO         0xE000
#define  USBHS_UD_FRAME_NO          0x07FF

/* R16_USB_BUS */
#define  USBHS_USB_DM_ST            0x08
#define  USBHS_USB_DP_ST            0x04
#define  USB_WAKEUP                 0x01

/* R16_UEP_TX_EN */
#define USBHS_UEP0_T_EN             0x0001
#define USBHS_UEP1_T_EN             0x0002
#define USBHS_UEP2_T_EN             0x0004
#define USBHS_UEP3_T_EN             0x0008
#define USBHS_UEP4_T_EN             0x0010
#define USBHS_UEP5_T_EN             0x0020
#define USBHS_UEP6_T_EN             0x0040
#define USBHS_UEP7_T_EN             0x0080
#define USBHS_UEP8_T_EN             0x0100
#define USBHS_UEP9_T_EN             0x0200
#define USBHS_UEP10_T_EN            0x0400
#define USBHS_UEP11_T_EN            0x0800
#define USBHS_UEP12_T_EN            0x1000
#define USBHS_UEP13_T_EN            0x2000
#define USBHS_UEP14_T_EN            0x4000
#define USBHS_UEP15_T_EN            0x8000

/* R16_UEP_RX_EN */
#define USBHS_UEP0_R_EN             0x0001
#define USBHS_UEP1_R_EN             0x0002
#define USBHS_UEP2_R_EN             0x0004
#define USBHS_UEP3_R_EN             0x0008
#define USBHS_UEP4_R_EN             0x0010
#define USBHS_UEP5_R_EN             0x0020
#define USBHS_UEP6_R_EN             0x0040
#define USBHS_UEP7_R_EN             0x0080
#define USBHS_UEP8_R_EN             0x0100
#define USBHS_UEP9_R_EN             0x0200
#define USBHS_UEP10_R_EN            0x0400
#define USBHS_UEP11_R_EN            0x0800
#define USBHS_UEP12_R_EN            0x1000
#define USBHS_UEP13_R_EN            0x2000
#define USBHS_UEP14_R_EN            0x4000
#define USBHS_UEP15_R_EN            0x8000

/* R16_UEP_T_TOG_AUTO */
#define USBHS_UEP_T_TOG_AUTO        0xFF

/* R16_UEP_R_TOG_AUTO */
#define USBHS_UEP_R_TOG_AUTO        0xFF

/* R8_UEP_T_BURST */
#define USBHS_UEP_T_BURST_EN        0xFF

/* R8_UEP_T_BURST_MODE */
#define USBHS_UEP_T_BURST_MODE      0xFF

/* R8_UEP_R_BURST */
#define USBHS_UEP_R_BURST_EN        0xFF

/* R8_UEP_R_RES_MODE */
#define USBHS_UEP_R_RES_MODE        0xFF

/* R32_UEP_AF_MODE */
#define USBHS_UEP_T_AF              0xFE

/* R32_UEP0_DMA */
#define UEPn_DMA                    0xFFFFFF

/* R32_UEPn_RX_DMA */
#define UEPn_RX_DMA                 0xFFFFFF

